export const IJAW_DIALECTS = [
  "Nembe",
  "Kalabari",
  "Okrika",
  "Kolokuma",
  "Ibani",
  "Epie-Atissa",
  "Ogbia",
  "Engenni",
  "Degema",
  "Kula",
  "Bille",
  "Wakrike",
  "Nkoro",
  "Defaka",
  "Egbema",
  "Epetiama"
];

export const SPECIAL_CHARS: Record<string, string[]> = {
  "a": ["á", "à", "â", "ã", "ä", "ā", "ă", "ą"],
  "e": ["é", "è", "ê", "ë", "ē", "ĕ", "ė", "ę", "ě", "ẹ", "ẹ́", "ẹ̀"],
  "i": ["í", "ì", "î", "ï", "ī", "ĭ", "į", "ı", "ị", "ị́", "ị̀"],
  "o": ["ó", "ò", "ô", "õ", "ö", "ō", "ŏ", "ő", "ọ", "ọ́", "ọ̀"],
  "u": ["ú", "ù", "û", "ü", "ũ", "ū", "ŭ", "ů", "ű", "ų", "ụ", "ụ́", "ụ̀"],
  "n": ["ñ", "ń", "ņ", "ň", "ŉ", "ŋ"],
  "s": ["ś", "ŝ", "ş", "š", "ș"],
  "z": ["ź", "ż", "ž"],
  "c": ["ć", "ĉ", "ċ", "č"],
  "g": ["ĝ", "ğ", "ġ", "ģ"],
  "h": ["ĥ", "ħ"],
  "j": ["ĵ"],
  "k": ["ķ", "ĸ"],
  "l": ["ĺ", "ļ", "ľ", "ŀ", "ł"],
  "r": ["ŕ", "ŗ", "ř"],
  "t": ["ť", "ŧ", "ț"],
  "w": ["ŵ"],
  "y": ["ý", "ÿ", "ŷ"]
};

export const AGREEMENT_THRESHOLD = 7;
